Repository: GisoreB/teacher_mate
Catalog: lib/l10n/intl_*.arb
Languages: fa

# themeMode
source: {theme_mode, select, dark{Dark} light{Light} system{System Default} other{Theme Mode}}
fa: {theme_mode, select, dark{تاریک} light{روشن} system{پیش فرض سیستم} other{حالت تم}}

source: Choose Theme
fa: انتخاب تم

source: Confirm
fa: ثبت

# languageMode
source: {language, select, en{English} fa{فارسی} system{System Default} other{Language}}
fa: {language, select, en{English} fa{فارسی} system{پیش فرض سیستم} other{زبان}}

source: Cancel
fa: انصراف

source: Language
fa: زبان

source: Settings
fa: تنظیمات

source: Teacher Mate
fa: تیچر میت

source: Add Class
fa: اضافه کردن کلاس

source: Create Class
fa: ایجاد کلاس

source: Save
fa: ذخیره

# classTitleLabel
source: Class Title*
fa: عنوان کلاس*

# enterClassTitleError
source: Enter class title
fa: عنوان کلاس را وارد کنید

# descriptionLabel
source: Description
fa: توضیحات

# durationLabel
source: Duration (min)*
fa: مدت زمان (دقیقه)*

# enterDurationError
source: Enter duration
fa: مدت زمان را وارد کنید

# numberOfSessionsLabel
source: Number of Sessions*
fa: تعداد جلسات*

# enterSessionCountError
source: Enter session count
fa: تعداد جلسات را وارد کنید

# pickFirstSessionDate
source: Pick Starting Class Date*
fa: تاریخ شروع کلاس را انتخاب کنید*

# firstSessionDate
source: Starting Class Date: {date}
fa: تاریخ شروع کلاس: {date}

# syllabusLabel
source: Syllabus
fa: سرفصل‌ها

# requiredFieldsNote
source: Fields marked with * are required.
fa: فیلدهای علامت‌گذاری‌شده با * الزامی هستند.

# createStudent
source: Add Student
fa: افزودن دانش‌آموز

# studentNameLabel
source: Student Name*
fa: نام دانش‌آموز*

# enterStudentNameError
source: Please enter the student''s name
fa: لطفاً نام دانش‌آموز را وارد کنید

# phoneLabel
source: Phone Number
fa: شماره تلفن

# emailLabel
source: Email Address
fa: آدرس ایمیل

# noteLabel
source: Note
fa: یادداشت

# pickSessionDate
source: Pick a session date and time*
fa: تاریخ و زمان جلسه را انتخاب کنید*

# date
source: Date: {date}
fa: تاریخ: {date}

# dateTitle
source: Date
fa: تاریخ

# scheduleSession
source: Schedule Session {value}
fa: برنامه‌ریزی جلسه {value}

source: Loading...
fa: در حال بارگذاری...

# error
source: Error: {error}
fa: خطا: {error}

# duration
source: {duration} min
fa: {duration} ذقیقه

source: Overview
fa: نمای کلی

source: Description
fa: توضیحات

# durationPerSession
source: Duration/Session
fa: مدت هر جلسه

source: Total Sessions
fa: تعداد جلسات

source: Starts On
fa: شروع از

source: Syllabus Outline
fa: طرح کلی سرفصل‌ها

source: Students
fa: دانش‌آموزان

source: Enroll New Student
fa: ثبت دانش‌آموز جدید

source: No Students Yet
fa: هنوز دانش‌آموزی ثبت نشده

# tapToEnrollFirstStudent
source: Tap the "+" icon above to enroll the first student.
fa: روی آیکون "+" بالا بزنید تا اولین دانش‌آموز را ثبت کنید.

source: Error Loading Students
fa: خطا در بارگذاری دانش‌آموزان

source: Error Loading Sessions
fa: خطا در بارگذاری جلسات

source: Sessions
fa: جلسات

source: Schedule New Session
fa: برنامه‌ریزی جلسه جدید

source: No Sessions Scheduled
fa: هنوز جلسه‌ای برنامه‌ریزی نشده

# tapToScheduleFirstSession
source: Tap the "+" button to schedule the first session.
fa: برای برنامه‌ریزی اولین جلسه، روی دکمه "+" بزنید.

# sessionNumber
source: Session {value}
fa: جلسه {value}

source: Session Details
fa: جزئیات جلسه

# sessionDuration
source: Duration
fa: مدت‌زمان

source: Status
fa: وضعیت

source: Ends On
fa: پایان در

source: Topic
fa: موضوع

source: Notes
fa: یادداشت‌ها

source: Note
fa: یادداشت

source: Error loading session.
fa: خطا در بارگذاری جلسه.

source: Homework
fa: تکلیف

# sessionNumberShort
source: S{value}
fa: ج{value}

# studentShort
source: S
fa: د

source: Edit Note
fa: ویرایش یادداشت

# enterNoteHint
source: Enter Note
fa: یادداشت را وارد کنید

source: Edit Homework
fa: ویرایش تکلیف

# enterHomeworkHint
source: Enter Homework
fa: تکلیف را وارد کنید

source: Scheduled
fa: برنامه‌ریزی‌شده

source: Completed
fa: تکمیل‌شده

source: Cancelled
fa: لغو‌شده

source: Substitute
fa: جانشین

# sessionStatus
source: {session_status, select, scheduled{Scheduled} completed{Completed} cancelled{Cancelled} substitute{Substitute} all{All} other{SessionStatus}}
fa: {session_status, select, scheduled{برنامه‌ریزی‌شده} completed{تکمیل‌شده} cancelled{لغو‌شده} substitute{جانشین} all{همه} other{وضعیت جلسه}}

source: Add Note
fa: افزودن یادداشت

source: Add Homework
fa: افزودن تکلیف

source: Attendance
fa: حضور و غیاب

# classActivity
source: Activity
fa: فعالیت

# goToClassToAddStudents
source: Head to the Class Page to Add Students
fa: برای افزودن دانش‌آموز به صفحه کلاس بروید

# sessionSummary
source: From: {dateFormatted} • {sessionCount} sessions • {count} left
fa: از: {dateFormatted} • {sessionCount} جلسه • {count} مانده

source: Sessions Left
fa: جلسات باقی مانده

# selectWeekdaysLabel
source: Select days of the week for sessions*
fa: روزهای هفته را برای جلسات انتخاب کنید*

source: Monday
fa: دوشنبه

source: Tuesday
fa: سه‌شنبه

source: Wednesday
fa: چهارشنبه

source: Thursday
fa: پنج‌شنبه

source: Friday
fa: جمعه

source: Saturday
fa: شنبه

source: Sunday
fa: یک‌شنبه

# pickFirstSessionDateError
source: Please pick the start session date.
fa: لطفاً تاریخ شروع کلاس را انتخاب کنید.

# selectSessionDaysError
source: Please select at least one session day.
fa: لطفاً حداقل یک روز برای جلسات انتخاب کنید.

source: Deactivate
fa: غیرفعال کردن

source: Activate
fa: فعال کردن

source: Active
fa: فعال

source: Inactive
fa: غیرفعال

# deactivateQuestion
source: Are you sure you want to deactivate this class?
fa: آیا از غیرفعال کردن این کلاس اطمینان دارید؟

# activateQuestion
source: Are you sure you want to activate this class?
fa: آیا از فعال کردن این کلاس اطمینان دارید؟

source: Add Syllabus
fa: افزودن سرفصل

# enterSyllabusHint
source: Enter Syllabus
fa: سرفصل را وارد کنید

source: Edit Class
fa: ویرایش کلاس

source: Quizzes
fa: آزمون‌ها

source: Create New Quiz
fa: ساخت آزمون جدید

# noQuizzesYet
source: No quizzes scheduled yet
fa: هنوز هیچ آزمونی برنامه‌ریزی نشده است

# tapToAddFirstQuiz
source: Tap the ''+'' button to schedule your first quiz.
fa: برای افزودن اولین آزمون، دکمه ''+'' را بزنید.

source: Error loading quizzes
fa: خطا در بارگذاری آزمون‌ها

# errorLoadingClass
source: Error loading class details
fa: خطا در بارگذاری جزئیات کلاس

# quizTitleLabel
source: Quiz Title*
fa: عنوان آزمون*

# enterQuizTitleHint
source: E.g., Chapter 1 Review
fa: مثلاً: مرور فصل اول

# quizDescriptionLabel
source: Description (Optional)
fa: توضیحات (اختیاری)

# enterQuizDescriptionHint
source: Any extra details about the quiz...
fa: جزئیات اضافی درباره آزمون...

source: Pick Quiz Date*
fa: تاریخ آزمون را انتخاب کنید*

# enterQuizTitleError
source: Please enter a quiz title.
fa: لطفاً عنوان آزمون را وارد کنید.

# pickQuizDateError
source: Please pick a date for the quiz.
fa: لطفاً تاریخ آزمون را انتخاب کنید.

source: Quiz Details
fa: جزئیات آزمون

source: Student Scores
fa: نمرات دانش‌آموزان

source: Save Results
fa: ذخیره نتایج

# noStudentsInClassForQuiz
source: No students are enrolled in this class to assign scores.
fa: هیچ دانش‌آموزی در این کلاس ثبت‌نام نکرده تا نمره‌ای اختصاص یابد.

# scoreLabel
source: Score
fa: نمره

# errorLoadingQuizDetails
source: Error: Could not load quiz details.
fa: خطا: بارگذاری جزئیات آزمون امکان‌پذیر نیست.

# errorLoadingQuizResults
source: Error: Could not load quiz results.
fa: خطا: بارگذاری نتایج آزمون امکان‌پذیر نیست.

source: Error saving results
fa: خطا در ذخیره‌سازی نتایج

# quizResultsSaved
source: Quiz results saved successfully!
fa: نتایج آزمون با موفقیت ذخیره شد!

# loadingScoreInput
source: Loading score...
fa: در حال بارگذاری نمره...

# invalidScoreFormatFor
source: Invalid score format for {studentName}.
fa: فرمت نمره نامعتبر برای {studentName}.

# invalidNumberShort
source: Invalid
fa: نامعتبر

source: Title
fa: عنوان

# fixScoreErrors
source: Please correct the errors in scores before saving.
fa: لطفاً خطاهای نمرات را پیش از ذخیره‌سازی اصلاح کنید.

# resultsSaved
source: Quiz results saved successfully!
fa: نتایج آزمون با موفقیت ذخیره شد!

source: Student Details
fa: جزئیات دانش‌آموز

source: Performance Summary
fa: خلاصه عملکرد

# totalAttendance
source: Attendance
fa: حضور و غیاب

# totalHomework
source: Homework
fa: تکالیف

# totalActivities
source: Class Activities
fa: فعالیت‌های کلاسی

source: Quiz Scores
fa: نمرات آزمون

# noQuizzesTaken
source: No quizzes taken yet.
fa: هیچ آزمونی گرفته نشده است.

source: Error loading student details.
fa: خطا در بارگذاری جزئیات دانش‌آموز.

# errorLoadingActivities
source: Error loading student activities.
fa: خطا در بارگذاری فعالیت‌های دانش‌آموز.

source: Error loading quiz scores.
fa: خطا در بارگذاری نمرات آزمون.

source: Student Note
fa: یادداشت دانش‌آموز

# addStudentNote
source: Add Note
fa: افزودن یادداشت

# editStudentNote
source: Edit Note
fa: ویرایش یادداشت

# enterStudentNoteHint
source: Enter any notes about the student...
fa: یادداشتی درباره دانش‌آموز وارد کنید...

# noNoteForStudent
source: No note recorded for this student.
fa: هیچ یادداشتی برای این دانش‌آموز ثبت نشده است.

source: Unknown Quiz
fa: آزمون ناشناخته

# basedOnNSessions
source: Based on {count} recorded sessions
fa: بر اساس {count} جلسه ثبت‌شده

source: Add Description
fa: افزودن توضیحات

source: Edit Description
fa: ویرایش توضیحات

source: Enter Description
fa: توضیحات را وارد کنید

source: Inactive Classes
fa: کلاس‌های غیرفعال

source: Classes
fa: کلاس ها

source: Upcoming Quiz
fa: آزمون پیش‌رو

source: Upcoming Session
fa: جلسه پیش‌رو

source: Today
fa: امروز

source: Tomorrow
fa: فردا

# editSessionDateTimeTitle
source: Edit Session Date & Time
fa: ویرایش تاریخ و زمان جلسه

# selectNewDateTimePrompt
source: Please select the new date and time.
fa: لطفاً تاریخ و زمان جدید جلسه را انتخاب کنید.

# cancelButton
source: Cancel
fa: لغو

# saveButton
source: Save
fa: ذخیره

# sessionDateTimeUpdatedSuccess
source: Session date and time updated!
fa: تاریخ و زمان جلسه با موفقیت به‌روز شد!

source: Error updating session date/time
fa: خطا در به‌روزرسانی تاریخ/زمان جلسه

# editQuizDateTimeTitle
source: Edit Quiz Date & Time
fa: ویرایش تاریخ و زمان آزمون

source: Pick Quiz Date & Time
fa: انتخاب تاریخ و زمان آزمون

# quizDateTimeUpdatedSuccess
source: Quiz date and time updated!
fa: تاریخ و زمان آزمون با موفقیت به‌روز شد!

source: Error updating quiz date/time
fa: خطا در به‌روزرسانی تاریخ/زمان آزمون

# editDateTooltip
source: Edit session date and time
fa: ویرایش تاریخ و زمان

# editDescriptionTooltip
source: Edit description
fa: ویرایش توضیحات

# errorLoadingQuiz
source: Error loading quiz details
fa: خطا در بارگذاری جزئیات آزمون

# confirmDeleteTitle
source: Confirm Delete
fa: تأیید حذف

# confirmDeleteSessionMessage
source: Are you sure you want to delete this session?
fa: آیا از حذف این جلسه اطمینان دارید؟

source: Delete
fa: حذف

# deleteSession
source: Delete
fa: حذف جلسه

source: Edit
fa: ویرایش

# confirmDeleteQuizMessage
source: Are you sure you want to delete this quiz?
fa: آیا از حذف این آزمون اطمینان دارید؟

source: Delete Quiz
fa: حذف آزمون

# confirmDeleteStudentMessage
source: Are you sure you want to delete this student?
fa: آیا از حذف این دانش‌آموز اطمینان دارید؟

source: Delete Student
fa: حذف دانش‌آموز

# confirmDeleteClassMessage
source: Are you sure you want to delete this class? This will also delete all its students, sessions, and quizzes.
fa: آیا از حذف این کلاس اطمینان دارید؟ این کار باعث حذف تمام دانش‌آموزان، جلسات و آزمون‌های مربوط به آن خواهد شد.

source: Delete Class
fa: حذف کلاس

# maxScoreLabel
source: Max Score
fa: سقف نمره

# enterMaxScoreHint
source: Enter the maximum score (optional)
fa: سقف نمره را وارد کنید (اختیاری)

source: Scores
fa: نمرات

# scoresFrom
source: Scores from {maxScore}
fa: نمره از {maxScore}

source: Edit Max Score
fa: ویرایش سقف نمره

source: Add Max Score
fa: افزودن سقف نمره

source: Enter Max Score
fa: وارد کردن سقف نمره

# emptyClassesCaption
source: You have no classes. Use the + button to add a new class.
fa: هیچ کلاسی ندارید. برای افزودن کلاس جدید، دکمه + را بزنید.

source: Select from Calendar
fa: انتخاب از تقویم

source: Select from Session Dates
fa: انتخاب از تاریخ‌های جلسات

# noScheduledSessions
source: No scheduled sessions found.
fa: جلسه زمان‌بندی‌شده‌ای یافت نشد.

source: Select Session
fa: انتخاب جلسه

source: Share
fa: اشتراک‌گذاری

source: Share as Text
fa: اشتراک‌گذاری به‌صورت متن

source: Share as Image
fa: اشتراک‌گذاری به‌صورت تصویر

source: Image capture failed.
fa: ثبت تصویر ناموفق بود.

source: Share failed
fa: اشتراک‌گذاری ناموفق بود

source: Session
fa: جلسه

# classLabel
source: Class
fa: کلاس

source: Class Name
fa: نام کلاس

source: Subject
fa: موضوع

source: Grade
fa: پایه

source: Quiz
fa: آزمون

source: Class Detail
fa: جزئیات کلاس

source: Minutes
fa: دقیقه

source: Not set
fa: تنظیم نشده

source: Share Class
fa: اشتراک‌گذاری کلاس

# pickSessionDateError
source: Please pick a date for the session.
fa: لطفاً یک تاریخ برای جلسه انتخاب کنید.

# welcomeTitle
source: Welcome to
fa: خوش آمدید به

# welcomeAppName
source: Teacher Mate!
fa: تیچر میت!

# welcomeDescription
source: Your companion for managing classes, students, sessions, and quizzes — all in one place. Organize your teaching life, track progress effortlessly, and focus more on what matters most: teaching and inspiring. Let''s make every class count! 🎓✨
fa: همراه شما برای مدیریت کلاس‌ها، دانش‌آموزان، جلسات و آزمون‌ها — همه در یک جا. زندگی تدریس خود را سازماندهی کنید، پیشرفت را بدون دردسر پیگیری کنید و بیشتر بر چیزی تمرکز کنید که اهمیت دارد: آموزش و الهام‌بخشی. بیایید هر کلاس را به فرصتی ارزشمند تبدیل کنیم! 🎓✨

# iAgreeTo
source: I agree to the
fa: مواففت با

# termsTitle
source: Terms and Conditions
fa: شرایط و ضوابط

# termsDialogContent
source: By using this app, you agree to the following Terms of Service. Please read them carefully. 1. Local Data Storage All information and data you enter into Teacher Mate — including class details, student records, sessions, and quiz data — are stored locally on your device. We do not collect, transmit, or store any user data on external servers. You are solely responsible for backing up your data and ensuring its integrity. 2. User Responsibility As a user of Teacher Mate, you agree to: • Use the app only for lawful and educational purposes. • Ensure that any data you input (e.g., student names or notes) complies with local laws and institutional policies. • Accept full responsibility for maintaining, securing, and, if necessary, deleting your stored information. We are not liable for any loss, corruption, or misuse of your data. 3. No Account or Cloud Integration Teacher Mate does not require an account or internet connection. There is no cloud sync or remote backup at this time. All data resides on the device and is inaccessible to the app developers. 4. Limitation of Liability Teacher Mate is provided "as is" without warranties of any kind. We are not liable for any direct, indirect, incidental, or consequential damages arising from the use (or inability to use) the app. This includes, but is not limited to, data loss, incorrect reporting, or missed sessions. 5. Intellectual Property All logos, designs, and the app interface are the property of the Teacher Mate development team. You may not copy, reproduce, or distribute any part of the app without written permission. 6. Prohibited Use You agree not to: • Reverse-engineer, decompile, or tamper with the app. • Use the app for commercial resale or unauthorized distribution. • Store or process sensitive data that you''re not legally allowed to handle. 7. Updates and Changes We may update the app to fix bugs, improve performance, or add features. These updates may change the behavior or appearance of the app, and continued use implies acceptance of such changes. 8. Termination We reserve the right to discontinue the app or restrict access if you breach these terms. You can also stop using the app at any time by uninstalling it. 9. Governing Law These terms are governed by the laws of your local jurisdiction. Any disputes shall be handled in accordance with those laws. By continuing to use Teacher Mate, you confirm that you have read, understood, and agreed to these Terms of Service.
fa: با استفاده از این اپلیکیشن، شما با شرایط استفاده زیر موافقت می‌کنید. لطفاً آن‌ها را با دقت مطالعه کنید. ۱. ذخیره‌سازی محلی داده‌ها تمام اطلاعاتی که در تیچر میت وارد می‌کنید — شامل جزئیات کلاس، اطلاعات دانش‌آموزان، جلسات و آزمون‌ها — فقط به صورت محلی روی دستگاه شما ذخیره می‌شود. ما هیچ‌گونه داده‌ای را جمع‌آوری، منتقل یا ذخیره نمی‌کنیم. مسئولیت پشتیبان‌گیری و حفاظت از داده‌ها کاملاً بر عهده‌ی شماست. ۲. مسئولیت کاربر شما به عنوان کاربر تیچر میت متعهد می‌شوید که: • فقط از اپلیکیشن برای اهداف آموزشی و قانونی استفاده کنید. • اطمینان حاصل کنید که اطلاعات وارد شده مطابق قوانین کشور و سیاست‌های مؤسسه باشد. • مسئول کامل نگهداری، امنیت و در صورت نیاز، حذف اطلاعات خود باشید. ما مسئولیتی در قبال از دست رفتن، خرابی یا سوء‌استفاده از داده‌های شما نداریم. ۳. بدون حساب کاربری یا فضای ابری برای استفاده از تیچر میت نیاز به ایجاد حساب کاربری یا اتصال به اینترنت ندارید. در حال حاضر همگام‌سازی ابری یا پشتیبان‌گیری آنلاین وجود ندارد. تمام اطلاعات فقط روی دستگاه شما ذخیره می‌شود و برای تیم توسعه‌دهنده قابل دسترسی نیست. ۴. محدودیت مسئولیت تیچر میت «همان‌گونه که هست» ارائه می‌شود و هیچ ضمانتی ندارد. ما مسئول هیچ‌گونه خسارت مستقیم یا غیرمستقیم ناشی از استفاده یا ناتوانی در استفاده از اپ نیستیم. این شامل از دست رفتن داده‌ها، گزارش‌گیری نادرست یا جلسات از دست رفته می‌شود. ۵. مالکیت معنوی تمام طراحی‌ها، لوگوها و رابط کاربری اپ متعلق به تیم توسعه تیچر میت است. کپی‌برداری یا بازتوزیع آن بدون مجوز کتبی ممنوع است. ۶. استفاده‌های ممنوع شما توافق می‌کنید که: • کد برنامه را مهندسی معکوس یا تغییر ندهید. • اپ را برای فروش یا توزیع تجاری استفاده نکنید. • اطلاعات حساس یا ممنوعه وارد اپ نکنید. ۷. بروزرسانی‌ها و تغییرات ممکن است برای بهبود عملکرد یا افزودن ویژگی‌ها، اپ به‌روزرسانی شود. استفاده‌ی شما از اپ به‌عنوان پذیرش این تغییرات تلقی می‌شود. ۸. قطع خدمات در صورت نقض این شرایط، ممکن است دسترسی شما به اپ محدود یا قطع شود. همچنین می‌توانید هر زمان که خواستید، اپ را حذف کرده و استفاده را متوقف کنید. ۹. قانون حاکم این شرایط بر اساس قوانین محل زندگی شما تنظیم می‌شود. هرگونه اختلاف بر اساس این قوانین بررسی خواهد شد. با ادامه استفاده از تیچر میت، شما تأیید می‌کنید که این شرایط را خوانده، درک کرده و پذیرفته‌اید.

source: Close
fa: بستن

source: Get Started
fa: شروع

source: Create Quiz
fa: ساخت آزمون

source: Enroll Student
fa: ثبت‌نام دانش‌آموز

# scheduleSessionBtn
source: Schedule Session
fa: برنامه‌ریزی جلسه

source: BETA
fa: بتا

source: Share Session
fa: اشتراک‌گذاری جلسه

source: Share Quiz
fa: اشتراک‌گذاری آزمون

source: Quiz Results
fa: نتایج آزمون

# themeModeTitle
source: Theme Mode
fa: حالت تم

# themeColorTitle
source: Theme Color
fa: رنگ تم

# themeColor
source: {theme_color, select, blue{Blue} yellow{Yellow} pink{Pink} purple{Purple} green{Green} red{Red} other{Theme Color}}
fa: {theme_color, select, blue{آبی} yellow{زرد} pink{صورتی} purple{بنفش} green{سبز} red{قرمز} other{رنگ تم}}

# addModeSingle
source: Single
fa: دانش‌آموز تکی

# addModeMultiple
source: Multiple
fa: چند دانش‌آموز

source: Calendar
fa: تقویم

# calendarType
source: {calendar_type, select, gregorian{Gregorian} persian{Persian} other{Calendar Type}}
fa: {calendar_type, select, gregorian{میلادی} persian{شمسی} other{نوع تقویم}}

source: Student
fa: دانش‌آموز

source: Student Report
fa: گزارش دانش‌آموز

source: Share Student Report
fa: اشتراک‌گذاری گزارش دانش‌آموز

source: Age
fa: سن

source: Background
fa: پیش زمینه

source: Add Age
fa: افزودن سن

source: Add Background
fa: افزودن پیش‌زمینه

source: Add Student Age
fa: افزودن سن دانش‌آموز

source: Edit Student Age
fa: ویرایش سن دانش‌آموز

source: Add Student Background
fa: افزودن پیش‌زمینه دانش‌آموز

source: Edit Student Background
fa: ویرایش پیش‌زمینه دانش‌آموز

# enterStudentAgeHint
source: Enter student age
fa: سن دانش‌آموز را وارد کنید

# enterStudentBackgroundHint
source: Enter student background
fa: پیش‌زمینهٔ دانش‌آموز را وارد کنید

source: All
fa: همه

# noSessionsFoundForFilter
source: No sessions found for this filter.
fa: جلسه‌ای برای این فیلتر یافت نشد.

# tryDifferentFilter
source: Try a different filter or check your schedule.
fa: فیلتر دیگری را امتحان کنید یا برنامه خود را بررسی کنید.
